import { Component, OnInit } from '@angular/core';
import { Data } from './Data/Data';


@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css']
})
export class AppComponent implements OnInit {
  

  photos: Data[] = [
    {name: "טניס", img: "assets/Photos/tennis.jpg", description: "טניס הוא משחק כדור הנערך בין שני שחקנים (במסגרת משחק יחידים) או שני זוגות שחקנים (משחק זוגות). מטרת המשחק היא לחבוט כדור גומי חלול באמצעות מחבט אל עבר צדו השני של המגרש"},
    {name: "כדוריד", img: "assets/Photos/handball.jpg", description: "כַּדּוּרְיָד הוא ענף ספורט קבוצתי תחרותי של משחקי כדור. במשחק משתתפות שתי קבוצות, בכל אחת מהן שישה שחקני שדה ושוער אחד. מטרת כל קבוצה להכניס את הכדור לשער הקבוצה היריבה ולהגן על שערה מפני הקבוצה היריבה (בדומה לכדורגל). תנועת הכדור במגרש בין השחקנים ובידי שחקן יחיד, וכן זריקתו לשער, מתבצעות באמצעות הידיים (בדומה לכדורסל). הניצחון במשחק מוגדר על פי צבירת נקודות"}, 
    {name: "בייסבול", img: "assets/Photos/baseball.jpg", description: "בייסבול הוא משחק כדור וספורט קבוצתי שמשחקות בו שתי קבוצות. במשחק כדור קשה וקטן בגודל של אגרוף נזרק ונחבט על ידי שחקן שחובט בכדור בעזרת מחבט מיוחד לכך. הניקוד מושג על ידי ריצה ונגיעה בסימנים על האדמה הנקראים בסיסים, ומכאן שמו של המשחק"}, 
    {name: "כדורסל", img: "assets/Photos/basketball.jpg", description: "כדורסל הוא משחק כדור וספורט קבוצתי, בו מתחרות זו בזו שתי קבוצות, בנות חמישה שחקנים כל אחת על המגרש, הצוברות נקודות באמצעות קליעת כדור משחק דרך חישוק הסל של הקבוצה היריבה"}, 
    {name: "כדורגל חופים", img: "assets/Photos/beach soccer.jpg", description: "כדורגל חופים הוא משחק כדור בין שתי קבוצות על משטח חול. במשחק משתתפים חמישה שחקנים בכל קבוצה, ויש אפשרות להחלפתם בשחקנים מחליפים הממתינים בספסל. אחד מהשחקנים בכל קבוצה הוא שוער, ולו מותר לגעת בכדור בידו ברחבת השוער (שליש משטח המגרש). האחרים הם שחקני שדה המשחקים בעזרת הרגליים והראש בלבד. כל שחקן רשאי להחליף את השוער בתפקידו במהלך המשחק"}, 
    {name: "ביליארד", img: "assets/Photos/Billiards.jpg", description: "ביליארד הוא משחק המשוחק על גבי שולחן מוארך, מצופה באריג, שבארבע מפינותיו ובמרכז כל דופן ארוכה ישנם כיסים (סך הכל 6). המטרה היא להכניס את הכדורים אל הכיסים בעזרת מקלות עץ ארוכים, בסדר מסוים לפי חוקי המשחק. המשחק נועד לשני שחקנים או לשני זוגות שחקנים"}, 
    {name: "כדורגל", img: "assets/Photos/football.jpg", description: "כדורגל (הלחם של כדור ורגל) הוא ענף הספורט הקבוצתי הפופולרי והנפוץ ביותר בעולם. במשחק משתתפות שתי קבוצות, שמטרת כל אחת מהן היא הכנסת כדור המשחק לתוך שערהּ של השנייה"}, 
    {name: "גולף" , img: "assets/Photos/golf.jpg", description: "גולף הוא משחק כדור שבו על השחקן להכניס כדור קטן לתוך גומה בקרקע המרוחקת ממנו מרחק מה בעזרת מחבטים שונים - כל זאת תוך כמה שפחות ניסיונות חבטה"}, 
    {name: "הוקי קרח", img: "assets/Photos/Ice hockey.jpg", description: "הוקי קרח הוא ענף ספורט קבוצתי קצבי ומהיר, אותו משחקים תוך כדי החלקה על קרח, ובאמצעות מקלות ייעודיים בעלי להב מעוקל, המשמשים על מנת לחבוט דיסקית עשויה גומי מגופר אל תוך שער הקבוצה היריבה כדי להבקיע אותו. הקבוצה שהבקיעה יותר שערים מיריבתה היא המנצחת במשחק"}, 
  ]
  selectedPhoto: Data;
  title = "ענפי ספורט";
 
  ngOnInit(): void {
    if(this.photos !== null)
      this.selectedPhoto = this.photos[0];
  }

  replaceSelected(name: string) {
    const p = this.photos.find(photo => photo.name === name);
    if(p !== undefined) {
      this.selectedPhoto = p;
    }
  }
 
}
